# Дано действительное число а. Не пользуясь никакими другими арифметическими операциями, кроме умножения, получить:
#     а) а^4 за две операции; 
#     б) а^6 за три операции;
#     в) а^7 за четыре операции;
#     г) а^8 за три операции;
#     д) а^9 за четыре операции;
#     е) а^10 за четыре операции;
#     ж) а^13 за пять операций;
#     з) а^15 за пять операций;
#     и) а^21 за шесть операций;
#     к) а^28 за шесть операций;
#     л) а^64 за шесть операций.

a = int(input('Choose a: '))

a4 = a**2 * a**2
a6 = a**2 * a**2 * a**2
a7 = a**2 * a**2 * a**2 * a